import numpy as np
import scipy.stats as stats
print('''Задача 1. Даны две  независимые выборки. Не соблюдается условие нормальности
x1  380,420, 290
y1 140,360,200,900
Сделайте вывод по результатам, полученным с помощью функции''')
x1 = np.array([380,420,290])
y1 = np.array([140,360,200,900])
alpha = 0.05
print(stats.mannwhitneyu(x1, y1))
print(''' pvalue=0.6285714285714286 > alpha, применяем нулевую гипотезу. Статистически значимых различий нет.''') 

print(''' Задача 2. Исследовалось влияние препарата на уровень давления пациентов.
Сначала измерялось давление до приема препарата, потом через 10 минут и через 30 минут. 
Есть ли статистически значимые различия?
1е измерение до приема препарата: 150, 160, 165, 145, 155
2е измерение через 10 минут: 140, 155, 150,  130, 135
3е измерение через 30 минут: 130, 130, 120, 130, 125''')
x1 = np.array([150, 160, 165, 145, 155])
x2 = np.array([140, 155, 150, 130, 135])
x3 = np.array([130, 130, 120, 130, 125])
alpha = 0.05
print(stats.friedmanchisquare(x1, x2, x3))
print(''' так как в результате применения функции FriedmanchisquareResult(statistic=9.578947368421062, pvalue=0.00831683351100441)
видно, что pvalue=0.00831683351100441 < alpha, применяем альтернативную гипотезу. Статистически значимые различия есть. 
и исследование показало, что препарат влияет на уровень давления пациентов.''')

print('Задача 3. Сравните 1 и 2 е измерения, предполагая, что 3го измерения через 30 минут не было')
x1 = np.array([150, 160, 165, 145, 155])
x2 = np.array([140, 155, 150, 130, 135])
alpha = 0.05
print(stats.wilcoxon(x1, x2))
print('Так как pvalue=0.0625 > alpha, применяем нулевую гипотезу. Статистически значимых различий нет и исследование показало, что препарат не влияет на уровень давления пациентов.')
print('''Задача 4. Даны 3 группы  учеников плавания.
# В 1 группе время на дистанцию 50 м составляют: 56, 60, 62, 55, 71, 67, 59, 58, 64, 67
# Вторая группа : 57, 58, 69, 48, 72, 70, 68, 71, 50, 53
# Третья группа: 57, 67, 49, 48, 47, 55, 66, 51, 54''')
x1 = np.array([56, 60, 62, 55, 71, 67, 59, 58, 64, 67])
x2 = np.array([57, 58, 69, 48, 72, 70, 68, 71, 50, 53])
x3 = np.array([57, 67, 49, 48, 47, 55, 66, 51, 54])
alpha = 0.05
print(stats.kruskal(x1, x2, x3))
print('Так как pvalue=0.0650380998590494 > alpha, применяем нулевую гипотезу. Статистически значимых различий нет и время на дистанцию 50 м одинаковое.')
print('''Задача 5 Заявляется, что партия изготавливается со средним арифметическим 2,5 см. 
Проверить данную гипотезу, если известно, что размеры изделий подчинены нормальному закону распределения.
Объем выборки 10, уровень статистической значимости 5%
2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34''')

weights = np.array([2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34])
n = 10
mean = weights.mean()
std = weights.std(ddof=1)
print(mean)
print(std)
t = (mean-2.5)/(std/np.sqrt(n))
print(t)
print(stats.t.ppf(0.975, 9))    
print('''так как )расчетное значение = 0.5630613661802959 > t-наблюдаемого  = 2.2621571627409915
Принимаем нулевую гипотезу, на уровне статистической значимости 5% статистически значимых различий нет''')